app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes"
---
  def index
    @quotes= Quote.all

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    begin
      @quote = Quote.find(params[:id])